import 'package:omega_qick/Pages/GeneralControllerPages/Wallets/workout.dart';


class WorkoutsList {
  final workouts = <Workout>[
    Workout('А. Крылов', '22.22', 'Оплата товара', '1 354,34', 'DEL',
        'Выполнено', "2020"),
    Workout('NASA, COMPANY', '22.22', 'Обмент токенами', '1 200,45', 'DEL',
        'Ожидание', "2020"),
    Workout('И. Поверлов', '22.22', 'Оплата товара', '12 325,34', 'DEL',
        'Отменено', "2020"),
    Workout('Б. Констант', '22.22', 'Оплата товара', '342 243,34', 'DEL',
        'Ожидание', "2020"),
    Workout('А. Пушкин', '22.22', 'Оплата товара', '234 232,34', 'DEL',
        'Выполнено', "2020"),
    Workout('А. Крылов', '22.22', 'Оплата товара', '1 354,34', 'DEL',
        'Выполнено', "2020"),
    Workout('NASA, COMPANY', '22.22', 'Обмент токенами', '1 200,45', 'DEL',
        'Ожидание', "2020"),
    Workout('И. Поверлов', '22.22', 'Оплата товара', '12 325,34', 'DEL',
        'Отменено', "2020"),
    Workout('Б. Констант', '22.22', 'Оплата товара', '342 243,34', 'DEL',
        'Ожидание', "2020"),
    Workout('А. Пушкин', '22.22', 'Оплата товара', '234 232,34', 'DEL',
        'Выполнено', "2020"),
    Workout('А. Крылов', '22.22', 'Оплата товара', '1 354,34', 'DEL',
        'Выполнено', "2020"),
    Workout('NASA, COMPANY', '22.22', 'Обмент токенами', '1 200,45', 'DEL',
        'Ожидание', "2020"),
    Workout('И. Поверлов', '22.22', 'Оплата товара', '12 325,34', 'DEL',
        'Отменено', "2020"),
    Workout('Б. Констант', '22.22', 'Оплата товара', '342 243,34', 'DEL',
        'Ожидание', "2020"),
    Workout('А. Пушкин', '22.22', 'Оплата товара', '234 232,34', 'DEL',
        'Выполнено', "2020"),
  ];
}
